[Killed] BlockStatement
employee-history/components/employee-history-form/employee-history-form.component.ts:52:20
     private cdr: ChangeDetectorRef,
   ) {}
 
-  ngOnInit(): void {
-    this.eventBusService
-      .on('cloneButtonClickEvent')
-      .pipe(takeUntil(this.ngUnsubscribe$))
-      .subscribe(() => {
-        this.employeeFormService.newGeneration();
-        this.cdr.markForCheck();
-      });
-
-    combineLatest([
-      this.monthsService.isMonthComplete$,
-      this.employeeFormService.employeeHistoryForm.statusChanges.pipe(
-        map((status) => status === 'VALID'),
-      ),
-    ])
-      .pipe(
-        map(([isMonthComplete, isValid]) => isMonthComplete && isValid),
-        distinctUntilChanged((prev, curr) => prev === curr && !curr),
-        takeUntil(this.ngUnsubscribe$),
-      )
-      .subscribe((isValid) => {
-        const data = this.employeeFormService.employeeHistoryForm.getRawValue();
-        this.updateFormEvent.emit({ isValid, data });
-      });
-  }
+  ngOnInit(): void {}
 
   ngOnChanges(): void {

[NoCoverage] BlockStatement
employee-history/components/employee-history-form/employee-history-form.component.ts:56:24
     this.eventBusService
       .on('cloneButtonClickEvent')
       .pipe(takeUntil(this.ngUnsubscribe$))
-      .subscribe(() => {
-        this.employeeFormService.newGeneration();
-        this.cdr.markForCheck();
-      });
+      .subscribe(() => {});
 
     combineLatest([

[Survived] ConditionalExpression
employee-history/components/employee-history-form/employee-history-form.component.ts:64:25
     combineLatest([
       this.monthsService.isMonthComplete$,
       this.employeeFormService.employeeHistoryForm.statusChanges.pipe(
-        map((status) => status === 'VALID'),
+        map((status) => true),
       ),
     ])

[Survived] EqualityOperator
employee-history/components/employee-history-form/employee-history-form.component.ts:64:25
     combineLatest([
       this.monthsService.isMonthComplete$,
       this.employeeFormService.employeeHistoryForm.statusChanges.pipe(
-        map((status) => status === 'VALID'),
+        map((status) => status !== 'VALID'),
       ),
     ])

[Survived] LogicalOperator
employee-history/components/employee-history-form/employee-history-form.component.ts:68:45
       ),
     ])
       .pipe(
-        map(([isMonthComplete, isValid]) => isMonthComplete && isValid),
+        map(([isMonthComplete, isValid]) => isMonthComplete || isValid),
         distinctUntilChanged((prev, curr) => prev === curr && !curr),
         takeUntil(this.ngUnsubscribe$),

[Survived] ArrowFunction
employee-history/components/employee-history-form/employee-history-form.component.ts:68:13
       ),
     ])
       .pipe(
-        map(([isMonthComplete, isValid]) => isMonthComplete && isValid),
+        map(() => undefined),
         distinctUntilChanged((prev, curr) => prev === curr && !curr),
         takeUntil(this.ngUnsubscribe$),

[Survived] ConditionalExpression
employee-history/components/employee-history-form/employee-history-form.component.ts:69:46
     ])
       .pipe(
         map(([isMonthComplete, isValid]) => isMonthComplete && isValid),
-        distinctUntilChanged((prev, curr) => prev === curr && !curr),
+        distinctUntilChanged((prev, curr) => true),
         takeUntil(this.ngUnsubscribe$),
       )

[Survived] ConditionalExpression
employee-history/components/employee-history-form/employee-history-form.component.ts:69:46
     ])
       .pipe(
         map(([isMonthComplete, isValid]) => isMonthComplete && isValid),
-        distinctUntilChanged((prev, curr) => prev === curr && !curr),
+        distinctUntilChanged((prev, curr) => true && !curr),
         takeUntil(this.ngUnsubscribe$),
       )

[Killed] BlockStatement
employee-history/components/employee-history-form/employee-history-form.component.ts:72:31
         distinctUntilChanged((prev, curr) => prev === curr && !curr),
         takeUntil(this.ngUnsubscribe$),
       )
-      .subscribe((isValid) => {
-        const data = this.employeeFormService.employeeHistoryForm.getRawValue();
-        this.updateFormEvent.emit({ isValid, data });
-      });
+      .subscribe((isValid) => {});
   }
 

[Survived] ObjectLiteral
employee-history/components/employee-history-form/employee-history-form.component.ts:74:35
       )
       .subscribe((isValid) => {
         const data = this.employeeFormService.employeeHistoryForm.getRawValue();
-        this.updateFormEvent.emit({ isValid, data });
+        this.updateFormEvent.emit({});
       });
   }

[Killed] BlockStatement
employee-history/components/employee-history-form/employee-history-form.component.ts:78:23
       });
   }
 
-  ngOnChanges(): void {
-    const [component] = this.init;
-    const { attrs } = component;
-    this.monthsService.years = attrs?.years;
-    this.monthsService.isNonStop = attrs?.nonStop;
-    this.monthsService.initSettings();
-    this.initData();
-  }
+  ngOnChanges(): void {}
 
   availableControlsOfType(type: string): EmployeeHistoryDataSource {

[Killed] BlockStatement
employee-history/components/employee-history-form/employee-history-form.component.ts:87:68
     this.initData();
   }
 
-  availableControlsOfType(type: string): EmployeeHistoryDataSource {
-    return this.ds.find((e: EmployeeHistoryDataSource) => String(e.type) === String(type));
-  }
+  availableControlsOfType(type: string): EmployeeHistoryDataSource {}
 
   private initData(): void {

[Killed] ConditionalExpression
employee-history/components/employee-history-form/employee-history-form.component.ts:88:59
   }
 
   availableControlsOfType(type: string): EmployeeHistoryDataSource {
-    return this.ds.find((e: EmployeeHistoryDataSource) => String(e.type) === String(type));
+    return this.ds.find((e: EmployeeHistoryDataSource) => false);
   }
 

[Killed] EqualityOperator
employee-history/components/employee-history-form/employee-history-form.component.ts:88:59
   }
 
   availableControlsOfType(type: string): EmployeeHistoryDataSource {
-    return this.ds.find((e: EmployeeHistoryDataSource) => String(e.type) === String(type));
+    return this.ds.find((e: EmployeeHistoryDataSource) => String(e.type) !== String(type));
   }
 

[Killed] BlockStatement
employee-history/components/employee-history-form/employee-history-form.component.ts:91:28
     return this.ds.find((e: EmployeeHistoryDataSource) => String(e.type) === String(type));
   }
 
-  private initData(): void {
-    this.employeeFormService.clearHistoryForm();
-
-    if (this.componentValue) {
-      this.componentValue.forEach((generation: EmployeeHistoryModel) => {
-        this.employeeFormService.newGeneration(generation);
-      });
-    } else {
-      this.employeeFormService.newGeneration();
-    }
-  }
+  private initData(): void {}
 }
 

[Killed] ConditionalExpression
employee-history/components/employee-history-form/employee-history-form.component.ts:94:9
   private initData(): void {
     this.employeeFormService.clearHistoryForm();
 
-    if (this.componentValue) {
+    if (false) {
       this.componentValue.forEach((generation: EmployeeHistoryModel) => {
         this.employeeFormService.newGeneration(generation);

[Killed] ConditionalExpression
employee-history/components/employee-history-form/employee-history-form.component.ts:94:9
   private initData(): void {
     this.employeeFormService.clearHistoryForm();
 
-    if (this.componentValue) {
+    if (true) {
       this.componentValue.forEach((generation: EmployeeHistoryModel) => {
         this.employeeFormService.newGeneration(generation);

[Killed] BlockStatement
employee-history/components/employee-history-form/employee-history-form.component.ts:95:73
     this.employeeFormService.clearHistoryForm();
 
     if (this.componentValue) {
-      this.componentValue.forEach((generation: EmployeeHistoryModel) => {
-        this.employeeFormService.newGeneration(generation);
-      });
+      this.componentValue.forEach((generation: EmployeeHistoryModel) => {});
     } else {
       this.employeeFormService.newGeneration();

[Killed] BlockStatement
employee-history/components/employee-history-form/employee-history-form.component.ts:98:12
       this.componentValue.forEach((generation: EmployeeHistoryModel) => {
         this.employeeFormService.newGeneration(generation);
       });
-    } else {
-      this.employeeFormService.newGeneration();
-    }
+    } else {}
   }
 }
