[Killed] ObjectLiteral
components/employee-history/services/employee-history.data-source.service.ts:12:7
 
   public getDataSourceByGender(gender: Gender = Gender.male): void {
     this.dataSource = [
-      {
-        label: `Я учил${gender === Gender.male ? 'ся' : 'ась'}`,
-        type: 'student',
-        position: '',
-        place: 'Место учебы без сокращений и аббревиатур',
-        placeHint: 'Как в дипломе или аттестате',
-        address: 'Юридический адрес полностью, включая регион и город',
-      },
+      {},
       {
         label: `Я работал${gender === Gender.male ? '' : 'а'}`,

[Killed] ConditionalExpression
components/employee-history/services/employee-history.data-source.service.ts:13:25
   public getDataSourceByGender(gender: Gender = Gender.male): void {
     this.dataSource = [
       {
-        label: `Я учил${gender === Gender.male ? 'ся' : 'ась'}`,
+        label: `Я учил${true ? 'ся' : 'ась'}`,
         type: 'student',
         position: '',

[Killed] EqualityOperator
components/employee-history/services/employee-history.data-source.service.ts:13:25
   public getDataSourceByGender(gender: Gender = Gender.male): void {
     this.dataSource = [
       {
-        label: `Я учил${gender === Gender.male ? 'ся' : 'ась'}`,
+        label: `Я учил${gender !== Gender.male ? 'ся' : 'ась'}`,
         type: 'student',
         position: '',

[Killed] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:15:19
       {
         label: `Я учил${gender === Gender.male ? 'ся' : 'ась'}`,
         type: 'student',
-        position: '',
+        position: "Stryker was here!",
         place: 'Место учебы без сокращений и аббревиатур',
         placeHint: 'Как в дипломе или аттестате',

[Killed] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:16:16
         label: `Я учил${gender === Gender.male ? 'ся' : 'ась'}`,
         type: 'student',
         position: '',
-        place: 'Место учебы без сокращений и аббревиатур',
+        place: "",
         placeHint: 'Как в дипломе или аттестате',
         address: 'Юридический адрес полностью, включая регион и город',

[Killed] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:17:20
         type: 'student',
         position: '',
         place: 'Место учебы без сокращений и аббревиатур',
-        placeHint: 'Как в дипломе или аттестате',
+        placeHint: "",
         address: 'Юридический адрес полностью, включая регион и город',
       },

[Killed] ObjectLiteral
components/employee-history/services/employee-history.data-source.service.ts:20:7
         placeHint: 'Как в дипломе или аттестате',
         address: 'Юридический адрес полностью, включая регион и город',
       },
-      {
-        label: `Я работал${gender === Gender.male ? '' : 'а'}`,
-        type: 'employed',
-        position: 'Ваша должность',
-        positionHint: 'Если вы ИП, указывайте — Индивидуальный предприниматель',
-        place: 'Место работы без сокращений и аббревиатур',
-        placeHint: 'Как в трудовой. Если вы ИП, указывайте — Индивидуальный предприниматель ФИО',
-        address: 'Юридический адрес полностью, включая регион и город',
-      },
+      {},
       {
         label: `Я служил${gender === Gender.male ? '' : 'а'}`,

[Killed] EqualityOperator
components/employee-history/services/employee-history.data-source.service.ts:21:28
         address: 'Юридический адрес полностью, включая регион и город',
       },
       {
-        label: `Я работал${gender === Gender.male ? '' : 'а'}`,
+        label: `Я работал${gender !== Gender.male ? '' : 'а'}`,
         type: 'employed',
         position: 'Ваша должность',

[Killed] ConditionalExpression
components/employee-history/services/employee-history.data-source.service.ts:21:28
         address: 'Юридический адрес полностью, включая регион и город',
       },
       {
-        label: `Я работал${gender === Gender.male ? '' : 'а'}`,
+        label: `Я работал${true ? '' : 'а'}`,
         type: 'employed',
         position: 'Ваша должность',

[Killed] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:22:15
       },
       {
         label: `Я работал${gender === Gender.male ? '' : 'а'}`,
-        type: 'employed',
+        type: "",
         position: 'Ваша должность',
         positionHint: 'Если вы ИП, указывайте — Индивидуальный предприниматель',

[Survived] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:23:19
       {
         label: `Я работал${gender === Gender.male ? '' : 'а'}`,
         type: 'employed',
-        position: 'Ваша должность',
+        position: "",
         positionHint: 'Если вы ИП, указывайте — Индивидуальный предприниматель',
         place: 'Место работы без сокращений и аббревиатур',

[Survived] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:24:23
         label: `Я работал${gender === Gender.male ? '' : 'а'}`,
         type: 'employed',
         position: 'Ваша должность',
-        positionHint: 'Если вы ИП, указывайте — Индивидуальный предприниматель',
+        positionHint: "",
         place: 'Место работы без сокращений и аббревиатур',
         placeHint: 'Как в трудовой. Если вы ИП, указывайте — Индивидуальный предприниматель ФИО',

[Survived] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:25:16
         type: 'employed',
         position: 'Ваша должность',
         positionHint: 'Если вы ИП, указывайте — Индивидуальный предприниматель',
-        place: 'Место работы без сокращений и аббревиатур',
+        place: "",
         placeHint: 'Как в трудовой. Если вы ИП, указывайте — Индивидуальный предприниматель ФИО',
         address: 'Юридический адрес полностью, включая регион и город',

[Survived] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:27:18
         positionHint: 'Если вы ИП, указывайте — Индивидуальный предприниматель',
         place: 'Место работы без сокращений и аббревиатур',
         placeHint: 'Как в трудовой. Если вы ИП, указывайте — Индивидуальный предприниматель ФИО',
-        address: 'Юридический адрес полностью, включая регион и город',
+        address: "",
       },
       {

[Survived] ConditionalExpression
components/employee-history/services/employee-history.data-source.service.ts:30:27
         address: 'Юридический адрес полностью, включая регион и город',
       },
       {
-        label: `Я служил${gender === Gender.male ? '' : 'а'}`,
+        label: `Я служил${false ? '' : 'а'}`,
         type: 'military',
         position: 'Воинская должность и звание',

[Survived] ConditionalExpression
components/employee-history/services/employee-history.data-source.service.ts:30:27
         address: 'Юридический адрес полностью, включая регион и город',
       },
       {
-        label: `Я служил${gender === Gender.male ? '' : 'а'}`,
+        label: `Я служил${true ? '' : 'а'}`,
         type: 'military',
         position: 'Воинская должность и звание',

[Survived] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:32:19
       {
         label: `Я служил${gender === Gender.male ? '' : 'а'}`,
         type: 'military',
-        position: 'Воинская должность и звание',
+        position: "",
         place: 'Номер части и род (вид) войск',
         placeHint: 'Как в военном билете',

[Survived] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:34:20
         type: 'military',
         position: 'Воинская должность и звание',
         place: 'Номер части и род (вид) войск',
-        placeHint: 'Как в военном билете',
+        placeHint: "",
         address: 'Юридический адрес полностью, включая регион и город',
       },

[Survived] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:35:18
         position: 'Воинская должность и звание',
         place: 'Номер части и род (вид) войск',
         placeHint: 'Как в военном билете',
-        address: 'Юридический адрес полностью, включая регион и город',
+        address: "",
       },
       {

[Survived] ConditionalExpression
components/employee-history/services/employee-history.data-source.service.ts:38:31
         address: 'Юридический адрес полностью, включая регион и город',
       },
       {
-        label: `Я не работал${gender === Gender.male ? '' : 'а'} и не учил${
+        label: `Я не работал${false ? '' : 'а'} и не учил${
           gender === Gender.male ? 'ся' : 'ась'
         }`,

[Survived] EqualityOperator
components/employee-history/services/employee-history.data-source.service.ts:38:31
         address: 'Юридический адрес полностью, включая регион и город',
       },
       {
-        label: `Я не работал${gender === Gender.male ? '' : 'а'} и не учил${
+        label: `Я не работал${gender !== Gender.male ? '' : 'а'} и не учил${
           gender === Gender.male ? 'ся' : 'ась'
         }`,

[Survived] EqualityOperator
components/employee-history/services/employee-history.data-source.service.ts:39:11
       },
       {
         label: `Я не работал${gender === Gender.male ? '' : 'а'} и не учил${
-          gender === Gender.male ? 'ся' : 'ась'
+          gender !== Gender.male ? 'ся' : 'ась'
         }`,
         type: 'unemployed',

[Survived] ConditionalExpression
components/employee-history/services/employee-history.data-source.service.ts:39:11
       },
       {
         label: `Я не работал${gender === Gender.male ? '' : 'а'} и не учил${
-          gender === Gender.male ? 'ся' : 'ась'
+          false ? 'ся' : 'ась'
         }`,
         type: 'unemployed',

[Survived] StringLiteral
components/employee-history/services/employee-history.data-source.service.ts:45:11
         position: '',
         place: '',
         address:
-          'Адрес постоянной регистрации (прописки) или временной регистрации (место пребывания) в этот период',
+          "",
       },
     ];
