[Survived] ArrayDeclaration
components/employee-history/services/employee-history.form.service.ts:30:50
 @Injectable()
 export class EmployeeHistoryFormService {
   employeeHistoryForm: FormArray = this.fb.array([]);
-  employeeHistory: Array<EmployeeHistoryModel> = [];
+  employeeHistory: Array<EmployeeHistoryModel> = ["Stryker was here"];
   generateForm: FormGroup;
 

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:41:5
     private monthsService: EmployeeHistoryMonthsService,
     private ds: EmployeeHistoryDataSourceService,
     private datesToolsService: DatesToolsService,
-  ) {
-    this.defaultType = 'student';
-  }
+  ) {}
 
   removeGeneration(index: number): void {

[Killed] StringLiteral
components/employee-history/services/employee-history.form.service.ts:42:24
     private ds: EmployeeHistoryDataSourceService,
     private datesToolsService: DatesToolsService,
   ) {
-    this.defaultType = 'student';
+    this.defaultType = "";
   }
 

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:45:41
     this.defaultType = 'student';
   }
 
-  removeGeneration(index: number): void {
-    this.employeeHistoryForm.removeAt(index);
-    this.monthsService.updateAvailableMonths(this.employeeHistoryForm.getRawValue());
-  }
+  removeGeneration(index: number): void {}
 
   newGeneration(generationData?: EmployeeHistoryModel): void {

[Killed] BooleanLiteral
components/employee-history/services/employee-history.form.service.ts:51:9
   }
 
   newGeneration(generationData?: EmployeeHistoryModel): void {
-    if (!this.isScreensAvailable(this.employeeHistoryForm.length)) {
+    if (this.isScreensAvailable(this.employeeHistoryForm.length)) {
       return;
     }

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:51:68
   }
 
   newGeneration(generationData?: EmployeeHistoryModel): void {
-    if (!this.isScreensAvailable(this.employeeHistoryForm.length)) {
-      return;
-    }
+    if (!this.isScreensAvailable(this.employeeHistoryForm.length)) {}
 
     const form: FormGroup = this.fb.group({

[Killed] ObjectLiteral
components/employee-history/services/employee-history.form.service.ts:55:43
       return;
     }
 
-    const form: FormGroup = this.fb.group({
-      type: [null, Validators.required],
-      from: [null, Validators.required],
-      to: [null, Validators.required],
-      error: [null, []],
-      position: [null],
-      place: [null],
-      address: [null],
-      checkboxToDate: [false],
-      minDateTo: [null],
-      label: [null],
-    });
+    const form: FormGroup = this.fb.group({});
 
     this.employeeHistoryForm.push(form);

[Survived] ArrayDeclaration
components/employee-history/services/employee-history.form.service.ts:56:13
     }
 
     const form: FormGroup = this.fb.group({
-      type: [null, Validators.required],
+      type: [],
       from: [null, Validators.required],
       to: [null, Validators.required],

[Killed] ArrayDeclaration
components/employee-history/services/employee-history.form.service.ts:59:21
       type: [null, Validators.required],
       from: [null, Validators.required],
       to: [null, Validators.required],
-      error: [null, []],
+      error: [null, ["Stryker was here"]],
       position: [null],
       place: [null],

[Survived] ArrayDeclaration
components/employee-history/services/employee-history.form.service.ts:62:16
       error: [null, []],
       position: [null],
       place: [null],
-      address: [null],
+      address: [],
       checkboxToDate: [false],
       minDateTo: [null],

[Survived] BooleanLiteral
components/employee-history/services/employee-history.form.service.ts:63:24
       position: [null],
       place: [null],
       address: [null],
-      checkboxToDate: [false],
+      checkboxToDate: [true],
       minDateTo: [null],
       label: [null],

[Survived] ArrayDeclaration
components/employee-history/services/employee-history.form.service.ts:63:23
       position: [null],
       place: [null],
       address: [null],
-      checkboxToDate: [false],
+      checkboxToDate: [],
       minDateTo: [null],
       label: [null],

[Survived] ArrayDeclaration
components/employee-history/services/employee-history.form.service.ts:64:18
       place: [null],
       address: [null],
       checkboxToDate: [false],
-      minDateTo: [null],
+      minDateTo: [],
       label: [null],
     });

[Survived] ArrayDeclaration
components/employee-history/services/employee-history.form.service.ts:65:14
       address: [null],
       checkboxToDate: [false],
       minDateTo: [null],
-      label: [null],
+      label: [],
     });
 

[Killed] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:71:9
     this.employeeHistoryForm.push(form);
     this.newGenerationWatch(form);
 
-    if (generationData) {
+    if (true) {
       for (const [key, value] of Object.entries(generationData)) {
         let convertedValue = value;

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:71:25
     this.employeeHistoryForm.push(form);
     this.newGenerationWatch(form);
 
-    if (generationData) {
-      for (const [key, value] of Object.entries(generationData)) {
-        let convertedValue = value;
-        if (['from', 'to'].includes(key)) {
-          convertedValue = new MonthYear(value?.month, value?.year);
-        }
-        form.get(key).patchValue(convertedValue);
-      }
-    } else {
+    if (generationData) {} else {
       form.get('type').patchValue(this.defaultType);
     }

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:72:66
     this.newGenerationWatch(form);
 
     if (generationData) {
-      for (const [key, value] of Object.entries(generationData)) {
-        let convertedValue = value;
-        if (['from', 'to'].includes(key)) {
-          convertedValue = new MonthYear(value?.month, value?.year);
-        }
-        form.get(key).patchValue(convertedValue);
-      }
+      for (const [key, value] of Object.entries(generationData)) {}
     } else {
       form.get('type').patchValue(this.defaultType);

[Killed] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:74:13
     if (generationData) {
       for (const [key, value] of Object.entries(generationData)) {
         let convertedValue = value;
-        if (['from', 'to'].includes(key)) {
+        if (true) {
           convertedValue = new MonthYear(value?.month, value?.year);
         }

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:74:43
     if (generationData) {
       for (const [key, value] of Object.entries(generationData)) {
         let convertedValue = value;
-        if (['from', 'to'].includes(key)) {
-          convertedValue = new MonthYear(value?.month, value?.year);
-        }
+        if (['from', 'to'].includes(key)) {}
         form.get(key).patchValue(convertedValue);
       }

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:79:12
         }
         form.get(key).patchValue(convertedValue);
       }
-    } else {
-      form.get('type').patchValue(this.defaultType);
-    }
+    } else {}
   }
 

[Killed] StringLiteral
components/employee-history/services/employee-history.form.service.ts:80:16
         form.get(key).patchValue(convertedValue);
       }
     } else {
-      form.get('type').patchValue(this.defaultType);
+      form.get("").patchValue(this.defaultType);
     }
   }

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:84:28
     }
   }
 
-  clearHistoryForm(): void {
-    this.employeeHistoryForm = this.fb.array([]);
-  }
+  clearHistoryForm(): void {}
 
   isScreensAvailable(length: number): boolean {

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:88:47
     this.employeeHistoryForm = this.fb.array([]);
   }
 
-  isScreensAvailable(length: number): boolean {
-    return length < defaultScreensAmount;
-  }
+  isScreensAvailable(length: number): boolean {}
 
   private newGenerationWatch(form: FormGroup): void {

[Killed] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:89:12
   }
 
   isScreensAvailable(length: number): boolean {
-    return length < defaultScreensAmount;
+    return false;
   }
 

[Killed] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:89:12
   }
 
   isScreensAvailable(length: number): boolean {
-    return length < defaultScreensAmount;
+    return true;
   }
 

[Killed] StringLiteral
components/employee-history/services/employee-history.form.service.ts:94:12
 
   private newGenerationWatch(form: FormGroup): void {
     form
-      .get('from')
+      .get("")
       .valueChanges.pipe(takeUntil(this.unsubscribeService))
       .subscribe((date: MonthYear) => {

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:96:39
     form
       .get('from')
       .valueChanges.pipe(takeUntil(this.unsubscribeService))
-      .subscribe((date: MonthYear) => {
-        form.get('minDateTo').patchValue(date);
-      });
+      .subscribe((date: MonthYear) => {});
 
     form

[Killed] StringLiteral
components/employee-history/services/employee-history.form.service.ts:97:18
       .get('from')
       .valueChanges.pipe(takeUntil(this.unsubscribeService))
       .subscribe((date: MonthYear) => {
-        form.get('minDateTo').patchValue(date);
+        form.get("").patchValue(date);
       });
 

[Killed] ArrowFunction
components/employee-history/services/employee-history.form.service.ts:103:16
     form
       .get('checkboxToDate')
       .valueChanges.pipe(
-        filter((checked: boolean) => checked),
+        filter(() => undefined),
         takeUntil(this.unsubscribeService),
       )

[Killed] BlockStatement
components/employee-history/services/employee-history.form.service.ts:106:24
         filter((checked: boolean) => checked),
         takeUntil(this.unsubscribeService),
       )
-      .subscribe(() => {
-        form.get('to').patchValue(MonthYear.fromDate(new Date()));
-      });
+      .subscribe(() => {});
 
     form

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:113:42
     form
       .get('type')
       .valueChanges.pipe(takeUntil(this.unsubscribeService))
-      .subscribe((type: EmployeeType) => {
-        this.setValidatorsByDataSource(
-          this.ds.dataSource.find((e: EmployeeHistoryDataSource) => e.type === type),
-          form,
-        );
-      });
+      .subscribe((type: EmployeeType) => {});
 
     combineLatest(form.get('from').valueChanges, form.get('to').valueChanges)

[Survived] ArrowFunction
components/employee-history/services/employee-history.form.service.ts:115:35
       .valueChanges.pipe(takeUntil(this.unsubscribeService))
       .subscribe((type: EmployeeType) => {
         this.setValidatorsByDataSource(
-          this.ds.dataSource.find((e: EmployeeHistoryDataSource) => e.type === type),
+          this.ds.dataSource.find(() => undefined),
           form,
         );

[Survived] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:115:69
       .valueChanges.pipe(takeUntil(this.unsubscribeService))
       .subscribe((type: EmployeeType) => {
         this.setValidatorsByDataSource(
-          this.ds.dataSource.find((e: EmployeeHistoryDataSource) => e.type === type),
+          this.ds.dataSource.find((e: EmployeeHistoryDataSource) => true),
           form,
         );

[Killed] StringLiteral
components/employee-history/services/employee-history.form.service.ts:120:28
         );
       });
 
-    combineLatest(form.get('from').valueChanges, form.get('to').valueChanges)
+    combineLatest(form.get("").valueChanges, form.get('to').valueChanges)
       .pipe(
         tap(([fromDateValue, toDateValue]) => this.checkDates(form, fromDateValue, toDateValue)),

[Survived] ArrowFunction
components/employee-history/services/employee-history.form.service.ts:122:13
 
     combineLatest(form.get('from').valueChanges, form.get('to').valueChanges)
       .pipe(
-        tap(([fromDateValue, toDateValue]) => this.checkDates(form, fromDateValue, toDateValue)),
+        tap(() => undefined),
         filter(([, toDate]) => toDate),
         takeUntil(this.unsubscribeService),

[Survived] ArrowFunction
components/employee-history/services/employee-history.form.service.ts:123:16
     combineLatest(form.get('from').valueChanges, form.get('to').valueChanges)
       .pipe(
         tap(([fromDateValue, toDateValue]) => this.checkDates(form, fromDateValue, toDateValue)),
-        filter(([, toDate]) => toDate),
+        filter(() => undefined),
         takeUntil(this.unsubscribeService),
       )

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:126:24
         filter(([, toDate]) => toDate),
         takeUntil(this.unsubscribeService),
       )
-      .subscribe(() => {
-        this.monthsService.updateAvailableMonths(this.employeeHistoryForm.getRawValue());
-      });
+      .subscribe(() => {});
   }
 

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:131:97
       });
   }
 
-  private checkDates(form: FormGroup, fromDateValue?: MonthYear, toDateValue?: MonthYear): void {
-    if (toDateValue) {
-      const today = this.datesToolsService.getToday();
-      const toDate: Date =  this.datesToolsService.setDate(today, toDateValue.year, toDateValue.month, null);
-      const minDate = this.datesToolsService.sub(today, this.monthsService.years, 'years');
-      const toDateMinDateDiff = this.datesToolsService.diff(toDate, minDate);
-      if (fromDateValue) {
-        const fromDate: Date = this.datesToolsService.setDate(today, fromDateValue.year, fromDateValue.month, null);
-        const fromDateToDateDiff = this.datesToolsService.diff(fromDate, toDate);
-        if (fromDateToDateDiff > 0) {
-          form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedDateTo });
-          return;
-        } else {
-          form.get('error').setErrors(null);
-        }
-      }
-      if (toDateMinDateDiff < 0) {
-        form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedPeriod });
-      } else {
-        form.get('error').setErrors(null);
-      }
-    }
-  }
+  private checkDates(form: FormGroup, fromDateValue?: MonthYear, toDateValue?: MonthYear): void {}
 
   private setValidatorsByDataSource(ds: EmployeeHistoryDataSource, form: FormGroup): void {

[Survived] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:132:9
   }
 
   private checkDates(form: FormGroup, fromDateValue?: MonthYear, toDateValue?: MonthYear): void {
-    if (toDateValue) {
+    if (false) {
       const today = this.datesToolsService.getToday();
       const toDate: Date =  this.datesToolsService.setDate(today, toDateValue.year, toDateValue.month, null);

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:132:22
   }
 
   private checkDates(form: FormGroup, fromDateValue?: MonthYear, toDateValue?: MonthYear): void {
-    if (toDateValue) {
-      const today = this.datesToolsService.getToday();
-      const toDate: Date =  this.datesToolsService.setDate(today, toDateValue.year, toDateValue.month, null);
-      const minDate = this.datesToolsService.sub(today, this.monthsService.years, 'years');
-      const toDateMinDateDiff = this.datesToolsService.diff(toDate, minDate);
-      if (fromDateValue) {
-        const fromDate: Date = this.datesToolsService.setDate(today, fromDateValue.year, fromDateValue.month, null);
-        const fromDateToDateDiff = this.datesToolsService.diff(fromDate, toDate);
-        if (fromDateToDateDiff > 0) {
-          form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedDateTo });
-          return;
-        } else {
-          form.get('error').setErrors(null);
-        }
-      }
-      if (toDateMinDateDiff < 0) {
-        form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedPeriod });
-      } else {
-        form.get('error').setErrors(null);
-      }
-    }
+    if (toDateValue) {}
   }
 

[Survived] StringLiteral
components/employee-history/services/employee-history.form.service.ts:135:83
     if (toDateValue) {
       const today = this.datesToolsService.getToday();
       const toDate: Date =  this.datesToolsService.setDate(today, toDateValue.year, toDateValue.month, null);
-      const minDate = this.datesToolsService.sub(today, this.monthsService.years, 'years');
+      const minDate = this.datesToolsService.sub(today, this.monthsService.years, "");
       const toDateMinDateDiff = this.datesToolsService.diff(toDate, minDate);
       if (fromDateValue) {

[Survived] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:137:11
       const toDate: Date =  this.datesToolsService.setDate(today, toDateValue.year, toDateValue.month, null);
       const minDate = this.datesToolsService.sub(today, this.monthsService.years, 'years');
       const toDateMinDateDiff = this.datesToolsService.diff(toDate, minDate);
-      if (fromDateValue) {
+      if (true) {
         const fromDate: Date = this.datesToolsService.setDate(today, fromDateValue.year, fromDateValue.month, null);
         const fromDateToDateDiff = this.datesToolsService.diff(fromDate, toDate);

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:137:26
       const toDate: Date =  this.datesToolsService.setDate(today, toDateValue.year, toDateValue.month, null);
       const minDate = this.datesToolsService.sub(today, this.monthsService.years, 'years');
       const toDateMinDateDiff = this.datesToolsService.diff(toDate, minDate);
-      if (fromDateValue) {
-        const fromDate: Date = this.datesToolsService.setDate(today, fromDateValue.year, fromDateValue.month, null);
-        const fromDateToDateDiff = this.datesToolsService.diff(fromDate, toDate);
-        if (fromDateToDateDiff > 0) {
-          form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedDateTo });
-          return;
-        } else {
-          form.get('error').setErrors(null);
-        }
-      }
+      if (fromDateValue) {}
       if (toDateMinDateDiff < 0) {
         form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedPeriod });

[Survived] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:140:13
       if (fromDateValue) {
         const fromDate: Date = this.datesToolsService.setDate(today, fromDateValue.year, fromDateValue.month, null);
         const fromDateToDateDiff = this.datesToolsService.diff(fromDate, toDate);
-        if (fromDateToDateDiff > 0) {
+        if (false) {
           form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedDateTo });
           return;

[NoCoverage] BlockStatement
components/employee-history/services/employee-history.form.service.ts:140:37
       if (fromDateValue) {
         const fromDate: Date = this.datesToolsService.setDate(today, fromDateValue.year, fromDateValue.month, null);
         const fromDateToDateDiff = this.datesToolsService.diff(fromDate, toDate);
-        if (fromDateToDateDiff > 0) {
-          form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedDateTo });
-          return;
-        } else {
+        if (fromDateToDateDiff > 0) {} else {
           form.get('error').setErrors(null);
         }

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:143:16
         if (fromDateToDateDiff > 0) {
           form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedDateTo });
           return;
-        } else {
-          form.get('error').setErrors(null);
-        }
+        } else {}
       }
       if (toDateMinDateDiff < 0) {

[NoCoverage] BlockStatement
components/employee-history/services/employee-history.form.service.ts:147:34
           form.get('error').setErrors(null);
         }
       }
-      if (toDateMinDateDiff < 0) {
-        form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedPeriod });
-      } else {
+      if (toDateMinDateDiff < 0) {} else {
         form.get('error').setErrors(null);
       }

[Survived] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:147:11
           form.get('error').setErrors(null);
         }
       }
-      if (toDateMinDateDiff < 0) {
+      if (true) {
         form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedPeriod });
       } else {

[NoCoverage] StringLiteral
components/employee-history/services/employee-history.form.service.ts:148:18
         }
       }
       if (toDateMinDateDiff < 0) {
-        form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedPeriod });
+        form.get("").setErrors({ error: EmployeeHostoryErrors.FailedPeriod });
       } else {
         form.get('error').setErrors(null);

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:149:14
       }
       if (toDateMinDateDiff < 0) {
         form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedPeriod });
-      } else {
-        form.get('error').setErrors(null);
-      }
+      } else {}
     }
   }

[Survived] StringLiteral
components/employee-history/services/employee-history.form.service.ts:150:18
       if (toDateMinDateDiff < 0) {
         form.get('error').setErrors({ error: EmployeeHostoryErrors.FailedPeriod });
       } else {
-        form.get('error').setErrors(null);
+        form.get("").setErrors(null);
       }
     }

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:155:91
     }
   }
 
-  private setValidatorsByDataSource(ds: EmployeeHistoryDataSource, form: FormGroup): void {
-    // Список контролов, на которых не нужно вешать валидаторы
-    const missedControls = ['type', 'label', 'positionHint', 'placeHint'];
-
-    for (const [key, value] of Object.entries(ds)) {
-      if (!missedControls.includes(key)) {
-        if (value) {
-          form.get(String(key)).setValidators([Validators.required, this.inputValidators()]);
-        } else {
-          form.get(String(key)).setValidators([Validators.nullValidator]);
-        }
-        form.get(String(key)).updateValueAndValidity();
-      }
-    }
-  }
+  private setValidatorsByDataSource(ds: EmployeeHistoryDataSource, form: FormGroup): void {}
 
   private inputValidators(): ValidatorFn {

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:159:52
     // Список контролов, на которых не нужно вешать валидаторы
     const missedControls = ['type', 'label', 'positionHint', 'placeHint'];
 
-    for (const [key, value] of Object.entries(ds)) {
-      if (!missedControls.includes(key)) {
-        if (value) {
-          form.get(String(key)).setValidators([Validators.required, this.inputValidators()]);
-        } else {
-          form.get(String(key)).setValidators([Validators.nullValidator]);
-        }
-        form.get(String(key)).updateValueAndValidity();
-      }
-    }
+    for (const [key, value] of Object.entries(ds)) {}
   }
 

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:160:42
     const missedControls = ['type', 'label', 'positionHint', 'placeHint'];
 
     for (const [key, value] of Object.entries(ds)) {
-      if (!missedControls.includes(key)) {
-        if (value) {
-          form.get(String(key)).setValidators([Validators.required, this.inputValidators()]);
-        } else {
-          form.get(String(key)).setValidators([Validators.nullValidator]);
-        }
-        form.get(String(key)).updateValueAndValidity();
-      }
+      if (!missedControls.includes(key)) {}
     }
   }

[Survived] BooleanLiteral
components/employee-history/services/employee-history.form.service.ts:160:11
     const missedControls = ['type', 'label', 'positionHint', 'placeHint'];
 
     for (const [key, value] of Object.entries(ds)) {
-      if (!missedControls.includes(key)) {
+      if (missedControls.includes(key)) {
         if (value) {
           form.get(String(key)).setValidators([Validators.required, this.inputValidators()]);

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:161:20
 
     for (const [key, value] of Object.entries(ds)) {
       if (!missedControls.includes(key)) {
-        if (value) {
-          form.get(String(key)).setValidators([Validators.required, this.inputValidators()]);
-        } else {
+        if (value) {} else {
           form.get(String(key)).setValidators([Validators.nullValidator]);
         }

[Survived] ConditionalExpression
components/employee-history/services/employee-history.form.service.ts:161:13
 
     for (const [key, value] of Object.entries(ds)) {
       if (!missedControls.includes(key)) {
-        if (value) {
+        if (true) {
           form.get(String(key)).setValidators([Validators.required, this.inputValidators()]);
         } else {

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:163:16
       if (!missedControls.includes(key)) {
         if (value) {
           form.get(String(key)).setValidators([Validators.required, this.inputValidators()]);
-        } else {
-          form.get(String(key)).setValidators([Validators.nullValidator]);
-        }
+        } else {}
         form.get(String(key)).updateValueAndValidity();
       }

[Survived] ArrayDeclaration
components/employee-history/services/employee-history.form.service.ts:164:47
         if (value) {
           form.get(String(key)).setValidators([Validators.required, this.inputValidators()]);
         } else {
-          form.get(String(key)).setValidators([Validators.nullValidator]);
+          form.get(String(key)).setValidators([]);
         }
         form.get(String(key)).updateValueAndValidity();

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:171:42
     }
   }
 
-  private inputValidators(): ValidatorFn {
-    //TODO: сделать валидацию через json
-    const errorMsg =
-      'Для ввода доступны только русские и латинские буквы, цифры, а также символы ()? /.",#№:;-+\'*<>&';
-
-    return (control: AbstractControl): ValidationErrors => {
-      const pattern = new RegExp(/^[a-zA-Zа-яА-ЯёЁ\d\s\(\)\?\.",#№:;\-\+\/'*<>&]{1,5530}$/, 'gm');
-      const hasError = !pattern.test(control.value);
-
-      return hasError ? { errorMsg } : null;
-    };
-  }
+  private inputValidators(): ValidatorFn {}
 }
 

[Survived] BlockStatement
components/employee-history/services/employee-history.form.service.ts:176:60
     const errorMsg =
       'Для ввода доступны только русские и латинские буквы, цифры, а также символы ()? /.",#№:;-+\'*<>&';
 
-    return (control: AbstractControl): ValidationErrors => {
-      const pattern = new RegExp(/^[a-zA-Zа-яА-ЯёЁ\d\s\(\)\?\.",#№:;\-\+\/'*<>&]{1,5530}$/, 'gm');
-      const hasError = !pattern.test(control.value);
-
-      return hasError ? { errorMsg } : null;
-    };
+    return (control: AbstractControl): ValidationErrors => {};
   }
 }

[Survived] Regex
components/employee-history/services/employee-history.form.service.ts:177:34
       'Для ввода доступны только русские и латинские буквы, цифры, а также символы ()? /.",#№:;-+\'*<>&';
 
     return (control: AbstractControl): ValidationErrors => {
-      const pattern = new RegExp(/^[a-zA-Zа-яА-ЯёЁ\d\s\(\)\?\.",#№:;\-\+\/'*<>&]{1,5530}$/, 'gm');
+      const pattern = new RegExp(/^[a-zA-Zа-яА-ЯёЁ\D\s\(\)\?\.",#№:;\-\+\/'*<>&]{1,5530}$/, 'gm');
       const hasError = !pattern.test(control.value);
 

[Survived] BooleanLiteral
components/employee-history/services/employee-history.form.service.ts:178:24
 
     return (control: AbstractControl): ValidationErrors => {
       const pattern = new RegExp(/^[a-zA-Zа-яА-ЯёЁ\d\s\(\)\?\.",#№:;\-\+\/'*<>&]{1,5530}$/, 'gm');
-      const hasError = !pattern.test(control.value);
+      const hasError = pattern.test(control.value);
 
       return hasError ? { errorMsg } : null;
