[Survived] ArrayDeclaration
components/employee-history/services/employee-history.months.service.ts:19:54
   maxDate: MonthYear;
   minDateFrom: MonthYear;
   minDateTo: MonthYear;
-  availableMonths: EmployeeHistoryAvailableDates[] = [];
+  availableMonths: EmployeeHistoryAvailableDates[] = ["Stryker was here"];
   isNonStop: boolean;
   isMonthComplete$: BehaviorSubject<boolean> = new BehaviorSubject<boolean>(false);

[Survived] BooleanLiteral
components/employee-history/services/employee-history.months.service.ts:21:77
   minDateTo: MonthYear;
   availableMonths: EmployeeHistoryAvailableDates[] = [];
   isNonStop: boolean;
-  isMonthComplete$: BehaviorSubject<boolean> = new BehaviorSubject<boolean>(false);
+  isMonthComplete$: BehaviorSubject<boolean> = new BehaviorSubject<boolean>(true);
 
   constructor(private datesToolsService: DatesToolsService) { }

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:25:24
 
   constructor(private datesToolsService: DatesToolsService) { }
 
-  initSettings(): void {
-    this.maxDate = MonthYear.fromDate(this.datesToolsService.endOfMonth(new Date()));
-    this.minDateFrom = MonthYear.fromDate(
-      this.datesToolsService.sub(new Date(), this.years + 60, 'years')
-    );
-    this.minDateTo = this.minDateFrom;
-    this.availableMonths = this.getAvailableMonths();
-  }
+  initSettings(): void {}
 
   getUncheckedPeriods(

[Survived] ArithmeticOperator
components/employee-history/services/employee-history.months.service.ts:28:46
   initSettings(): void {
     this.maxDate = MonthYear.fromDate(this.datesToolsService.endOfMonth(new Date()));
     this.minDateFrom = MonthYear.fromDate(
-      this.datesToolsService.sub(new Date(), this.years + 60, 'years')
+      this.datesToolsService.sub(new Date(), this.years - 60, 'years')
     );
     this.minDateTo = this.minDateFrom;

[Killed] BooleanLiteral
components/employee-history/services/employee-history.months.service.ts:37:9
   getUncheckedPeriods(
     availableMonths: EmployeeHistoryAvailableDates[],
   ): EmployeeHistoryUncheckedPeriod[] {
-    if (!availableMonths.length) return [];
+    if (availableMonths.length) return [];
 
     const periods: Array<Array<EmployeeHistoryAvailableDates>> = [];

[Killed] ConditionalExpression
components/employee-history/services/employee-history.months.service.ts:37:9
   getUncheckedPeriods(
     availableMonths: EmployeeHistoryAvailableDates[],
   ): EmployeeHistoryUncheckedPeriod[] {
-    if (!availableMonths.length) return [];
+    if (true) return [];
 
     const periods: Array<Array<EmployeeHistoryAvailableDates>> = [];

[Survived] ArrayDeclaration
components/employee-history/services/employee-history.months.service.ts:39:66
   ): EmployeeHistoryUncheckedPeriod[] {
     if (!availableMonths.length) return [];
 
-    const periods: Array<Array<EmployeeHistoryAvailableDates>> = [];
+    const periods: Array<Array<EmployeeHistoryAvailableDates>> = ["Stryker was here"];
     let periodIndex = 0;
 

[Killed] ArrayDeclaration
components/employee-history/services/employee-history.months.service.ts:42:28
     const periods: Array<Array<EmployeeHistoryAvailableDates>> = [];
     let periodIndex = 0;
 
-    periods[periodIndex] = [];
+    periods[periodIndex] = ["Stryker was here"];
 
     for (let i = 0; i < availableMonths.length; i++) {

[Killed] ConditionalExpression
components/employee-history/services/employee-history.months.service.ts:44:21
 
     periods[periodIndex] = [];
 
-    for (let i = 0; i < availableMonths.length; i++) {
+    for (let i = 0; false; i++) {
       if (availableMonths[i].checked) {
         if (!availableMonths[i + 1]?.checked) {

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:44:54
 
     periods[periodIndex] = [];
 
-    for (let i = 0; i < availableMonths.length; i++) {
-      if (availableMonths[i].checked) {
-        if (!availableMonths[i + 1]?.checked) {
-          periodIndex++;
-          periods[periodIndex] = [];
-        }
-      } else {
-        periods[periodIndex].push(availableMonths[i]);
-      }
-    }
+    for (let i = 0; i < availableMonths.length; i++) {}
 
     const getPeriod = (type: 'min' | 'max', convertedDates: Array<Date>): string => {

[Killed] ConditionalExpression
components/employee-history/services/employee-history.months.service.ts:45:11
     periods[periodIndex] = [];
 
     for (let i = 0; i < availableMonths.length; i++) {
-      if (availableMonths[i].checked) {
+      if (true) {
         if (!availableMonths[i + 1]?.checked) {
           periodIndex++;

[NoCoverage] BlockStatement
components/employee-history/services/employee-history.months.service.ts:45:39
     periods[periodIndex] = [];
 
     for (let i = 0; i < availableMonths.length; i++) {
-      if (availableMonths[i].checked) {
-        if (!availableMonths[i + 1]?.checked) {
-          periodIndex++;
-          periods[periodIndex] = [];
-        }
-      } else {
+      if (availableMonths[i].checked) {} else {
         periods[periodIndex].push(availableMonths[i]);
       }

[NoCoverage] BooleanLiteral
components/employee-history/services/employee-history.months.service.ts:46:13
 
     for (let i = 0; i < availableMonths.length; i++) {
       if (availableMonths[i].checked) {
-        if (!availableMonths[i + 1]?.checked) {
+        if (availableMonths[i + 1]?.checked) {
           periodIndex++;
           periods[periodIndex] = [];

[NoCoverage] BlockStatement
components/employee-history/services/employee-history.months.service.ts:46:47
 
     for (let i = 0; i < availableMonths.length; i++) {
       if (availableMonths[i].checked) {
-        if (!availableMonths[i + 1]?.checked) {
-          periodIndex++;
-          periods[periodIndex] = [];
-        }
+        if (!availableMonths[i + 1]?.checked) {}
       } else {
         periods[periodIndex].push(availableMonths[i]);

[NoCoverage] UpdateOperator
components/employee-history/services/employee-history.months.service.ts:47:11
     for (let i = 0; i < availableMonths.length; i++) {
       if (availableMonths[i].checked) {
         if (!availableMonths[i + 1]?.checked) {
-          periodIndex++;
+          periodIndex--;
           periods[periodIndex] = [];
         }

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:50:14
           periodIndex++;
           periods[periodIndex] = [];
         }
-      } else {
-        periods[periodIndex].push(availableMonths[i]);
-      }
+      } else {}
     }
 

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:55:85
       }
     }
 
-    const getPeriod = (type: 'min' | 'max', convertedDates: Array<Date>): string => {
-      const date = this.datesToolsService[type](convertedDates);
-      return this.datesToolsService.format(date, DATE_STRING_MMMM_YYYY_FORMAT);
-    };
+    const getPeriod = (type: 'min' | 'max', convertedDates: Array<Date>): string => {};
 
     return periods

[Killed] ArrowFunction
components/employee-history/services/employee-history.months.service.ts:61:15
     };
 
     return periods
-      .filter((period) => period.length)
+      .filter(() => undefined)
       .map((period: EmployeeHistoryAvailableDates[]) => {
         const convertedDates: Array<Date> = period.map(

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:62:57
 
     return periods
       .filter((period) => period.length)
-      .map((period: EmployeeHistoryAvailableDates[]) => {
-        const convertedDates: Array<Date> = period.map(
-          (stringDate: EmployeeHistoryAvailableDates) => this.getConvertedDates(stringDate),
-        );
-
-        return {
-          from: getPeriod('min', convertedDates),
-          to: getPeriod('max', convertedDates),
-        };
-      });
+      .map((period: EmployeeHistoryAvailableDates[]) => {});
   }
 

[Killed] ArrowFunction
components/employee-history/services/employee-history.months.service.ts:64:11
       .filter((period) => period.length)
       .map((period: EmployeeHistoryAvailableDates[]) => {
         const convertedDates: Array<Date> = period.map(
-          (stringDate: EmployeeHistoryAvailableDates) => this.getConvertedDates(stringDate),
+          () => undefined,
         );
 

[Killed] ObjectLiteral
components/employee-history/services/employee-history.months.service.ts:67:16
           (stringDate: EmployeeHistoryAvailableDates) => this.getConvertedDates(stringDate),
         );
 
-        return {
-          from: getPeriod('min', convertedDates),
-          to: getPeriod('max', convertedDates),
-        };
+        return {};
       });
   }

[Killed] StringLiteral
components/employee-history/services/employee-history.months.service.ts:69:25
 
         return {
           from: getPeriod('min', convertedDates),
-          to: getPeriod('max', convertedDates),
+          to: getPeriod("", convertedDates),
         };
       });

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:74:72
       });
   }
 
-  updateAvailableMonths(generation: Array<EmployeeHistoryModel>): void {
-    this.uncheckAvailableMonths();
-
-    generation.forEach((e: EmployeeHistoryModel) => {
-      if (e.from && e.to) {
-        const availableMonths: Array<string> = this.getAvailableMonths(
-          this.datesToolsService.setDate(new Date(), e.from.year, e.from.month, null),
-          this.datesToolsService.setDate(new Date(), e.to.year, e.to.month, null)
-        ).map((e: EmployeeHistoryAvailableDates) => e.date);
-
-        this.availableMonths = this.availableMonths.map((e: EmployeeHistoryAvailableDates) => ({
-          ...e,
-          checked: availableMonths.includes(e.date) || e.checked,
-        }));
-      }
-    });
-
-    this.checkMonthCompleted();
-  }
+  updateAvailableMonths(generation: Array<EmployeeHistoryModel>): void {}
 
   private getAvailableMonths(

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:77:53
   updateAvailableMonths(generation: Array<EmployeeHistoryModel>): void {
     this.uncheckAvailableMonths();
 
-    generation.forEach((e: EmployeeHistoryModel) => {
-      if (e.from && e.to) {
-        const availableMonths: Array<string> = this.getAvailableMonths(
-          this.datesToolsService.setDate(new Date(), e.from.year, e.from.month, null),
-          this.datesToolsService.setDate(new Date(), e.to.year, e.to.month, null)
-        ).map((e: EmployeeHistoryAvailableDates) => e.date);
-
-        this.availableMonths = this.availableMonths.map((e: EmployeeHistoryAvailableDates) => ({
-          ...e,
-          checked: availableMonths.includes(e.date) || e.checked,
-        }));
-      }
-    });
+    generation.forEach((e: EmployeeHistoryModel) => {});
 
     this.checkMonthCompleted();

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:78:27
     this.uncheckAvailableMonths();
 
     generation.forEach((e: EmployeeHistoryModel) => {
-      if (e.from && e.to) {
-        const availableMonths: Array<string> = this.getAvailableMonths(
-          this.datesToolsService.setDate(new Date(), e.from.year, e.from.month, null),
-          this.datesToolsService.setDate(new Date(), e.to.year, e.to.month, null)
-        ).map((e: EmployeeHistoryAvailableDates) => e.date);
-
-        this.availableMonths = this.availableMonths.map((e: EmployeeHistoryAvailableDates) => ({
-          ...e,
-          checked: availableMonths.includes(e.date) || e.checked,
-        }));
-      }
+      if (e.from && e.to) {}
     });
 

[Killed] ConditionalExpression
components/employee-history/services/employee-history.months.service.ts:78:11
     this.uncheckAvailableMonths();
 
     generation.forEach((e: EmployeeHistoryModel) => {
-      if (e.from && e.to) {
+      if (false) {
         const availableMonths: Array<string> = this.getAvailableMonths(
           this.datesToolsService.setDate(new Date(), e.from.year, e.from.month, null),

[Killed] ArrowFunction
components/employee-history/services/employee-history.months.service.ts:82:15
         const availableMonths: Array<string> = this.getAvailableMonths(
           this.datesToolsService.setDate(new Date(), e.from.year, e.from.month, null),
           this.datesToolsService.setDate(new Date(), e.to.year, e.to.month, null)
-        ).map((e: EmployeeHistoryAvailableDates) => e.date);
+        ).map(() => undefined);
 
         this.availableMonths = this.availableMonths.map((e: EmployeeHistoryAvailableDates) => ({

[Killed] ArrowFunction
components/employee-history/services/employee-history.months.service.ts:84:57
           this.datesToolsService.setDate(new Date(), e.to.year, e.to.month, null)
         ).map((e: EmployeeHistoryAvailableDates) => e.date);
 
-        this.availableMonths = this.availableMonths.map((e: EmployeeHistoryAvailableDates) => ({
-          ...e,
-          checked: availableMonths.includes(e.date) || e.checked,
-        }));
+        this.availableMonths = this.availableMonths.map(() => undefined);
       }
     });

[Killed] LogicalOperator
components/employee-history/services/employee-history.months.service.ts:86:20
 
         this.availableMonths = this.availableMonths.map((e: EmployeeHistoryAvailableDates) => ({
           ...e,
-          checked: availableMonths.includes(e.date) || e.checked,
+          checked: availableMonths.includes(e.date) && e.checked,
         }));
       }

[Killed] ConditionalExpression
components/employee-history/services/employee-history.months.service.ts:86:20
 
         this.availableMonths = this.availableMonths.map((e: EmployeeHistoryAvailableDates) => ({
           ...e,
-          checked: availableMonths.includes(e.date) || e.checked,
+          checked: false,
         }));
       }

[Killed] StringLiteral
components/employee-history/services/employee-history.months.service.ts:95:73
   }
 
   private getAvailableMonths(
-    fromDate: Date = this.datesToolsService.sub(new Date(), this.years, 'years'),
+    fromDate: Date = this.datesToolsService.sub(new Date(), this.years, ""),
     toDate: Date = new Date(),
   ): EmployeeHistoryAvailableDates[] {

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:97:38
   private getAvailableMonths(
     fromDate: Date = this.datesToolsService.sub(new Date(), this.years, 'years'),
     toDate: Date = new Date(),
-  ): EmployeeHistoryAvailableDates[] {
-    const availableDates = [];
-
-    while (this.datesToolsService.diff(toDate, fromDate) >= 0) {
-      availableDates.push({
-        date: this.datesToolsService.format( fromDate, DATE_MONTH_YEAR_FORMAT),
-        checked: false,
-      });
-      fromDate = this.datesToolsService.add( fromDate, 1, 'months');
-    }
-
-    return availableDates;
-  }
+  ): EmployeeHistoryAvailableDates[] {}
 
   private uncheckAvailableMonths(): void {

[Killed] EqualityOperator
components/employee-history/services/employee-history.months.service.ts:100:12
   ): EmployeeHistoryAvailableDates[] {
     const availableDates = [];
 
-    while (this.datesToolsService.diff(toDate, fromDate) >= 0) {
+    while (this.datesToolsService.diff(toDate, fromDate) < 0) {
       availableDates.push({
         date: this.datesToolsService.format( fromDate, DATE_MONTH_YEAR_FORMAT),

[Killed] ConditionalExpression
components/employee-history/services/employee-history.months.service.ts:100:12
   ): EmployeeHistoryAvailableDates[] {
     const availableDates = [];
 
-    while (this.datesToolsService.diff(toDate, fromDate) >= 0) {
+    while (false) {
       availableDates.push({
         date: this.datesToolsService.format( fromDate, DATE_MONTH_YEAR_FORMAT),

[Killed] ObjectLiteral
components/employee-history/services/employee-history.months.service.ts:101:27
     const availableDates = [];
 
     while (this.datesToolsService.diff(toDate, fromDate) >= 0) {
-      availableDates.push({
-        date: this.datesToolsService.format( fromDate, DATE_MONTH_YEAR_FORMAT),
-        checked: false,
-      });
+      availableDates.push({});
       fromDate = this.datesToolsService.add( fromDate, 1, 'months');
     }

[Survived] BooleanLiteral
components/employee-history/services/employee-history.months.service.ts:103:18
     while (this.datesToolsService.diff(toDate, fromDate) >= 0) {
       availableDates.push({
         date: this.datesToolsService.format( fromDate, DATE_MONTH_YEAR_FORMAT),
-        checked: false,
+        checked: true,
       });
       fromDate = this.datesToolsService.add( fromDate, 1, 'months');

[Survived] BlockStatement
components/employee-history/services/employee-history.months.service.ts:111:42
     return availableDates;
   }
 
-  private uncheckAvailableMonths(): void {
-    this.availableMonths = this.availableMonths.map((month: EmployeeHistoryAvailableDates) => ({
-      ...month,
-      checked: false,
-    }));
-  }
+  private uncheckAvailableMonths(): void {}
 
   private checkMonthCompleted(): void {

[Killed] ArrowFunction
components/employee-history/services/employee-history.months.service.ts:112:53
   }
 
   private uncheckAvailableMonths(): void {
-    this.availableMonths = this.availableMonths.map((month: EmployeeHistoryAvailableDates) => ({
-      ...month,
-      checked: false,
-    }));
+    this.availableMonths = this.availableMonths.map(() => undefined);
   }
 

[Survived] BooleanLiteral
components/employee-history/services/employee-history.months.service.ts:114:16
   private uncheckAvailableMonths(): void {
     this.availableMonths = this.availableMonths.map((month: EmployeeHistoryAvailableDates) => ({
       ...month,
-      checked: false,
+      checked: true,
     }));
   }

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:118:39
     }));
   }
 
-  private checkMonthCompleted(): void {
-    if (this.isNonStop) {
-      const isComplete: boolean = this.availableMonths.every(
-        (e: EmployeeHistoryAvailableDates) => e.checked,
-      );
-      this.isMonthComplete$.next(isComplete);
-    } else {
-      const convertedDate = this.availableMonths
-        .filter((stringDate: EmployeeHistoryAvailableDates) => stringDate.checked)
-        .map((stringDate: EmployeeHistoryAvailableDates) => this.getConvertedDates(stringDate));
-      const maxDate = this.datesToolsService.max(convertedDate);
-      const minDate = this.datesToolsService.min(convertedDate);
-      const diff = this.datesToolsService.differenceInYears( maxDate, minDate);
-      this.isMonthComplete$.next(diff === this.years);
-    }
-  }
+  private checkMonthCompleted(): void {}
 
   /**

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:119:25
   }
 
   private checkMonthCompleted(): void {
-    if (this.isNonStop) {
-      const isComplete: boolean = this.availableMonths.every(
-        (e: EmployeeHistoryAvailableDates) => e.checked,
-      );
-      this.isMonthComplete$.next(isComplete);
-    } else {
+    if (this.isNonStop) {} else {
       const convertedDate = this.availableMonths
         .filter((stringDate: EmployeeHistoryAvailableDates) => stringDate.checked)

[Survived] ConditionalExpression
components/employee-history/services/employee-history.months.service.ts:119:9
   }
 
   private checkMonthCompleted(): void {
-    if (this.isNonStop) {
+    if (false) {
       const isComplete: boolean = this.availableMonths.every(
         (e: EmployeeHistoryAvailableDates) => e.checked,

[Survived] ArrowFunction
components/employee-history/services/employee-history.months.service.ts:121:9
   private checkMonthCompleted(): void {
     if (this.isNonStop) {
       const isComplete: boolean = this.availableMonths.every(
-        (e: EmployeeHistoryAvailableDates) => e.checked,
+        () => undefined,
       );
       this.isMonthComplete$.next(isComplete);

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:124:12
         (e: EmployeeHistoryAvailableDates) => e.checked,
       );
       this.isMonthComplete$.next(isComplete);
-    } else {
-      const convertedDate = this.availableMonths
-        .filter((stringDate: EmployeeHistoryAvailableDates) => stringDate.checked)
-        .map((stringDate: EmployeeHistoryAvailableDates) => this.getConvertedDates(stringDate));
-      const maxDate = this.datesToolsService.max(convertedDate);
-      const minDate = this.datesToolsService.min(convertedDate);
-      const diff = this.datesToolsService.differenceInYears( maxDate, minDate);
-      this.isMonthComplete$.next(diff === this.years);
-    }
+    } else {}
   }
 

[Survived] ArrowFunction
components/employee-history/services/employee-history.months.service.ts:126:17
       this.isMonthComplete$.next(isComplete);
     } else {
       const convertedDate = this.availableMonths
-        .filter((stringDate: EmployeeHistoryAvailableDates) => stringDate.checked)
+        .filter(() => undefined)
         .map((stringDate: EmployeeHistoryAvailableDates) => this.getConvertedDates(stringDate));
       const maxDate = this.datesToolsService.max(convertedDate);

[Survived] ArrowFunction
components/employee-history/services/employee-history.months.service.ts:127:14
     } else {
       const convertedDate = this.availableMonths
         .filter((stringDate: EmployeeHistoryAvailableDates) => stringDate.checked)
-        .map((stringDate: EmployeeHistoryAvailableDates) => this.getConvertedDates(stringDate));
+        .map(() => undefined);
       const maxDate = this.datesToolsService.max(convertedDate);
       const minDate = this.datesToolsService.min(convertedDate);

[Survived] ConditionalExpression
components/employee-history/services/employee-history.months.service.ts:131:34
       const maxDate = this.datesToolsService.max(convertedDate);
       const minDate = this.datesToolsService.min(convertedDate);
       const diff = this.datesToolsService.differenceInYears( maxDate, minDate);
-      this.isMonthComplete$.next(diff === this.years);
+      this.isMonthComplete$.next(false);
     }
   }

[Survived] EqualityOperator
components/employee-history/services/employee-history.months.service.ts:131:34
       const maxDate = this.datesToolsService.max(convertedDate);
       const minDate = this.datesToolsService.min(convertedDate);
       const diff = this.datesToolsService.differenceInYears( maxDate, minDate);
-      this.isMonthComplete$.next(diff === this.years);
+      this.isMonthComplete$.next(diff !== this.years);
     }
   }

[Killed] BlockStatement
components/employee-history/services/employee-history.months.service.ts:141:78
    * @private
    * @example: getConvertedDates({ date: '05/2020'}) => Date (05/01/2020)
    */
-  private getConvertedDates(stringDate: EmployeeHistoryAvailableDates): Date {
-    const arrParsedDate: string[] = stringDate.date.split('/');
-    return this.datesToolsService.parse(`${arrParsedDate[0]}/01/${arrParsedDate[1]}`, DATE_STRING_SLASH_FORMAT);
-  }
+  private getConvertedDates(stringDate: EmployeeHistoryAvailableDates): Date {}
 }
 
