[Survived] ArrayDeclaration
employee-history/components/employee-history-desription/employee-history-description.component.ts:13:56
 })
 export class EmployeeHistoryDescriptionComponent {
   @Input() years: number;
-  @Input() periods: EmployeeHistoryUncheckedPeriod[] = [];
+  @Input() periods: EmployeeHistoryUncheckedPeriod[] = ["Stryker was here"];
   @Input() isCompleted: boolean;
 

[Killed] BlockStatement
employee-history/components/employee-history-desription/employee-history-description.component.ts:16:68
   @Input() periods: EmployeeHistoryUncheckedPeriod[] = [];
   @Input() isCompleted: boolean;
 
-  public getPeriod(period: EmployeeHistoryUncheckedPeriod): string {
-    const isPeriodEqul: boolean = period.from === period.to;
-    return isPeriodEqul ? period.from : `${period.from} — ${period.to}`;
-  }
+  public getPeriod(period: EmployeeHistoryUncheckedPeriod): string {}
 }
 

[Killed] ConditionalExpression
employee-history/components/employee-history-desription/employee-history-description.component.ts:17:35
   @Input() isCompleted: boolean;
 
   public getPeriod(period: EmployeeHistoryUncheckedPeriod): string {
-    const isPeriodEqul: boolean = period.from === period.to;
+    const isPeriodEqul: boolean = false;
     return isPeriodEqul ? period.from : `${period.from} — ${period.to}`;
   }

[Killed] ConditionalExpression
employee-history/components/employee-history-desription/employee-history-description.component.ts:17:35
   @Input() isCompleted: boolean;
 
   public getPeriod(period: EmployeeHistoryUncheckedPeriod): string {
-    const isPeriodEqul: boolean = period.from === period.to;
+    const isPeriodEqul: boolean = true;
     return isPeriodEqul ? period.from : `${period.from} — ${period.to}`;
   }
