[Killed] BlockStatement
components/employee-history/container/employee-history-container.component.ts:32:26
 
   init$: Observable<[ComponentDto, Gender]> = combineLatest([this.component$, this.gender$]).pipe(
     // eslint-disable-next-line @typescript-eslint/no-unused-vars
-    tap(([_, gender]) => {
-      this.dataSourceService.getDataSourceByGender(gender);
-      this.ds = this.dataSourceService.dataSource;
-    }),
+    tap(([_, gender]) => {}),
   );
 

[Killed] BlockStatement
components/employee-history/container/employee-history-container.component.ts:49:82
     private eventBusService: EventBusService,
   ) {}
 
-  public updateEmployeeHistory({ data, isValid }: EmployeeHistoryFormData): void {
-    this.isValid = isValid;
-    this.employeeHistoryData = data;
-  }
+  public updateEmployeeHistory({ data, isValid }: EmployeeHistoryFormData): void {}
 
   public getNextScreen(): void {

[Killed] BlockStatement
components/employee-history/container/employee-history-container.component.ts:54:32
     this.employeeHistoryData = data;
   }
 
-  public getNextScreen(): void {
-    const employeeHistoryBeforeSend: Array<EmployeeHistoryServerModel> = this.employeeHistoryData.map(
-      (employee: EmployeeHistoryModel) => this.formatToServerModel(employee),
-    );
-    this.eventBusService.emit('nextStepEvent', JSON.stringify(employeeHistoryBeforeSend));
-  }
+  public getNextScreen(): void {}
 
   private formatToServerModel(employee: EmployeeHistoryModel): EmployeeHistoryServerModel {

[Killed] ArrowFunction
components/employee-history/container/employee-history-container.component.ts:56:7
 
   public getNextScreen(): void {
     const employeeHistoryBeforeSend: Array<EmployeeHistoryServerModel> = this.employeeHistoryData.map(
-      (employee: EmployeeHistoryModel) => this.formatToServerModel(employee),
+      () => undefined,
     );
     this.eventBusService.emit('nextStepEvent', JSON.stringify(employeeHistoryBeforeSend));

[Killed] BlockStatement
components/employee-history/container/employee-history-container.component.ts:61:91
     this.eventBusService.emit('nextStepEvent', JSON.stringify(employeeHistoryBeforeSend));
   }
 
-  private formatToServerModel(employee: EmployeeHistoryModel): EmployeeHistoryServerModel {
-    const { minDateTo, to, from, ...employeeHistory } = employee;
-
-    const toFormatted = { ...to, monthCode: months[to.month] };
-    const fromFormatted = { ...from, monthCode: months[from.month] };
-    const chosenRole = this.ds.filter((role) => role.type === employee.type);
-
-    delete employeeHistory.error;
-    return {
-      ...employeeHistory,
-      to: toFormatted,
-      from: fromFormatted,
-      label: chosenRole[0]?.label || null,
-    };
-  }
+  private formatToServerModel(employee: EmployeeHistoryModel): EmployeeHistoryServerModel {}
 }
 

[Killed] EqualityOperator
components/employee-history/container/employee-history-container.component.ts:66:49
 
     const toFormatted = { ...to, monthCode: months[to.month] };
     const fromFormatted = { ...from, monthCode: months[from.month] };
-    const chosenRole = this.ds.filter((role) => role.type === employee.type);
+    const chosenRole = this.ds.filter((role) => role.type !== employee.type);
 
     delete employeeHistory.error;

[Killed] ConditionalExpression
components/employee-history/container/employee-history-container.component.ts:66:49
 
     const toFormatted = { ...to, monthCode: months[to.month] };
     const fromFormatted = { ...from, monthCode: months[from.month] };
-    const chosenRole = this.ds.filter((role) => role.type === employee.type);
+    const chosenRole = this.ds.filter((role) => true);
 
     delete employeeHistory.error;

[Killed] ObjectLiteral
components/employee-history/container/employee-history-container.component.ts:69:12
     const chosenRole = this.ds.filter((role) => role.type === employee.type);
 
     delete employeeHistory.error;
-    return {
-      ...employeeHistory,
-      to: toFormatted,
-      from: fromFormatted,
-      label: chosenRole[0]?.label || null,
-    };
+    return {};
   }
 }

[Killed] ConditionalExpression
components/employee-history/container/employee-history-container.component.ts:73:14
       ...employeeHistory,
       to: toFormatted,
       from: fromFormatted,
-      label: chosenRole[0]?.label || null,
+      label: true,
     };
   }

[Killed] LogicalOperator
components/employee-history/container/employee-history-container.component.ts:73:14
       ...employeeHistory,
       to: toFormatted,
       from: fromFormatted,
-      label: chosenRole[0]?.label || null,
+      label: chosenRole[0]?.label && null,
     };
   }
